Repository: isjust11/readbox
Catalog: lib/gen/i18n/locales/intl_*.arb
Languages: vi

source: Loading...
vi: Đang tải...

source: Error
vi: Lỗi

source: Success
vi: Thành công

source: Warning
vi: Cảnh báo

source: Info
vi: Thông tin

source: Confirm
vi: Xác nhận

source: Cancel
vi: Hủy

source: Close
vi: Đóng

source: Retry
vi: Thử lại

source: Refresh
vi: Làm mới

source: Search
vi: Tìm kiếm

# input_username
source: Enter username
vi: Nhập tên đăng nhập

source: Username
vi: Tên đăng nhập

# pls_input_username
source: Please enter username
vi: Vui lòng nhập tên đăng nhập

source: Login
vi: Đăng nhập

source: Logout
vi: Đăng xuất

source: Register
vi: Đăng ký

source: Forgot password
vi: Quên mật khẩu

source: Reset password
vi: Đặt lại mật khẩu

source: Verify email
vi: Xác thực email

source: Verify code
vi: Xác thực mã

# empty
source: No data
vi: Không có dữ liệu

# pull_to_refresh
source: Pull down to refresh
vi: Kéo xuống để làm mới

source: Try again
vi: Thử lại

# error_common
source: Something went wrong, please try again later
vi: Đã xảy ra lỗi, vui lòng thử lại sau

source: Agree
vi: Đồng ý

source: Disagree
vi: Không đồng ý

source: Done
vi: Hoàn thành

source: Home
vi: Trang chủ

source: News
vi: Tin tức

source: Profile
vi: Hồ sơ

source: Settings
vi: Cài đặt

# error_connection
source: No internet connection
vi: Không có kết nối internet

source: My library
vi: Thư viện của tôi

source: Search books...
vi: Tìm kiếm sách...

source: Favorite books
vi: Sách yêu thích

source: Archived books
vi: Sách đã lưu

# book_discover
source: Discover
vi: Khám phá

source: Public books
vi: Sách công khai

source: Private books
vi: Sách riêng tư

source: My books
vi: Sách của tôi

source: Add book
vi: Thêm sách

source: Edit book
vi: Sửa sách

source: Delete book
vi: Xóa sách

source: All data loaded
vi: Đã tải hết dữ liệu

source: Add book to start reading
vi: Thêm sách để bắt đầu đọc

source: No books
vi: Chưa có sách nào

source: Error loading books
vi: Lỗi tải sách

source: Retry loading books
vi: Thử lại tải sách

source: Loading books
vi: Đang tải sách

source: Loading more books
vi: Đang tải thêm sách

source: Loading more books failed
vi: Lỗi tải thêm sách

source: Loading more books completed
vi: Đã tải thêm sách

source: Loading more books no data
vi: Không có dữ liệu để tải thêm

# local_library
source: On device
vi: Thư viện Local

source: Upload book
vi: Tải sách lên

source: Feedback
vi: Phản hồi

source: Google Play Services not available
vi: Google Play Services không khả dụng

source: User cancelled Google sign in
vi: Người dùng đã hủy đăng nhập Google

source: User cancelled Facebook sign in
vi: Người dùng đã hủy đăng nhập Facebook

source: User cancelled Apple sign in
vi: Người dùng đã hủy đăng nhập Apple

source: User cancelled Twitter sign in
vi: Người dùng đã hủy đăng nhập Twitter

source: User cancelled LinkedIn sign in
vi: Người dùng đã hủy đăng nhập LinkedIn

source: User cancelled GitHub sign in
vi: Người dùng đã hủy đăng nhập GitHub

source: User cancelled GitLab sign in
vi: Người dùng đã hủy đăng nhập GitLab

source: User cancelled Bitbucket sign in
vi: Người dùng đã hủy đăng nhập Bitbucket

source: User cancelled sign in
vi: Người dùng đã hủy đăng nhập

source: Google signin failed
vi: Đăng nhập Google thất bại

source: Google network error
vi: Lỗi mạng Google

source: Google invalid client
vi: Client Google không hợp lệ

source: Google developer error
vi: Lỗi phát triển Google

source: Google timeout
vi: Thời gian đăng nhập Google hết hạn

source: Facebook access token is null
vi: Token Facebook là null

source: Facebook login failed
vi: Đăng nhập Facebook thất bại

source: Facebook network error
vi: Lỗi mạng Facebook

source: Facebook invalid client
vi: Client Facebook không hợp lệ

source: No name
vi: Không có tên

source: Edit profile
vi: Chỉnh sửa hồ sơ

# updateYourInfo
source: Update your information
vi: Cập nhật thông tin

source: Security
vi: Bảo mật

source: Privacy settings
vi: Cài đặt quyền riêng tư

source: Language
vi: Ngôn ngữ

source: Change app language
vi: Thay đổi ngôn ngữ ứng dụng

source: Theme
vi: Giao diện

source: Choose app appearance
vi: Chọn giao diện ứng dụng

source: Notifications
vi: Thông báo

source: Manage notifications
vi: Quản lý thông báo

source: Biometric login
vi: Đăng nhập sinh trắc học

source: Biometric not available
vi: Sinh trắc học không khả dụng

source: Use fingerprint or Face ID
vi: Sử dụng vân tay hoặc Face ID

source: Help center
vi: Trung tâm trợ giúp

source: Get help and support
vi: Nhận trợ giúp và hỗ trợ

source: Send feedback
vi: Gửi phản hồi

source: Share your thoughts
vi: Chia sẻ suy nghĩ của bạn

source: About app
vi: Về ứng dụng

source: Version
vi: Phiên bản

source: Light
vi: Sáng

source: Dark
vi: Tối

# noLoginInfo
source: No login information
vi: Không có thông tin đăng nhập

# biometricSetupSuccess
source: Biometric setup successful
vi: Thiết lập sinh trắc học thành công

source: Biometric disabled
vi: Đã tắt sinh trắc học

# feedbackSuccess
source: Feedback sent successfully
vi: Gửi phản hồi thành công

# feedbackContact
source: Contact information
vi: Thông tin liên hệ

# feedbackDescription
source: We would love to hear your feedback to improve the app
vi: Chúng tôi rất mong nhận được phản hồi từ bạn để cải thiện ứng dụng

source: Feedback type
vi: Loại phản hồi

# feedbackPriority
source: Priority
vi: Mức độ ưu tiên

# feedbackTitle
source: Title
vi: Tiêu đề

# feedbackTitleRequired
source: Please enter a title
vi: Vui lòng nhập tiêu đề

# feedbackTitleMinLength
source: Title must be at least 5 characters
vi: Tiêu đề phải có ít nhất 5 ký tự

# feedbackContent
source: Content
vi: Nội dung

# feedbackContentRequired
source: Please enter content
vi: Vui lòng nhập nội dung

# feedbackContentMinLength
source: Content must be at least 10 characters
vi: Nội dung phải có ít nhất 10 ký tự

# feedbackName
source: Name
vi: Tên

# feedbackEmailInvalid
source: Invalid email
vi: Email không hợp lệ

# feedbackPhone
source: Phone number
vi: Số điện thoại

# feedbackPhoneInvalid
source: Invalid phone number
vi: Số điện thoại không hợp lệ

# feedbackOptions
source: Options
vi: Tùy chọn

# feedbackAnonymous
source: Send anonymously
vi: Gửi ẩn danh

# feedbackAnonymousDescription
source: Send feedback without displaying personal information
vi: Gửi phản hồi mà không hiển thị thông tin cá nhân

# feedbackSend
source: Send feedback
vi: Gửi phản hồi

source: Login to continue
vi: Đăng nhập để tiếp tục

source: Register to continue
vi: Đăng ký để tiếp tục

source: Register now
vi: Đăng ký ngay

source: Login now
vi: Đăng nhập ngay

source: Login with Google
vi: Đăng nhập với Google

source: Login with Facebook
vi: Đăng nhập với Facebook

source: Login with Apple
vi: Đăng nhập với Apple

source: Login with Twitter
vi: Đăng nhập với Twitter

source: Login with LinkedIn
vi: Đăng nhập với LinkedIn

source: Login with GitHub
vi: Đăng nhập với GitHub

source: Login with GitLab
vi: Đăng nhập với GitLab

source: Login with Bitbucket
vi: Đăng nhập với Bitbucket

source: Login with email
vi: Đăng nhập với email

source: Login with phone
vi: Đăng nhập với số điện thoại

source: Login with username
vi: Đăng nhập với tên đăng nhập

source: Login with password
vi: Đăng nhập với mật khẩu

source: Login with OTP
vi: Đăng nhập với mã OTP

source: Login with PIN
vi: Đăng nhập với mã PIN

source: Login with Face ID
vi: Đăng nhập với Face ID

source: Login with fingerprint
vi: Đăng nhập với vân tay

source: Login with biometric
vi: Đăng nhập với sinh trắc học

source: Welcome back!
vi: Chào mừng trở lại!

source: Enter username
vi: Nhập tên đăng nhập

source: Enter password
vi: Nhập mật khẩu

source: Please enter username
vi: Vui lòng nhập tên đăng nhập

source: Please enter password
vi: Vui lòng nhập mật khẩu

source: Password must be at least 6 characters
vi: Mật khẩu phải có ít nhất 6 ký tự

source: No account?
vi: Chưa có tài khoản?

source: Have account?
vi: Đã có tài khoản?

source: Password
vi: Mật khẩu

# phone
source: Phone number
vi: Số điện thoại

source: Full name
vi: Họ và tên

source: Confirm password
vi: Xác nhận mật khẩu

source: Enter email
vi: Nhập email

# enter_phone
source: Enter phone number
vi: Nhập số điện thoại

source: Enter full name
vi: Nhập họ và tên

source: Enter confirm password
vi: Nhập lại mật khẩu

source: Please enter confirm password
vi: Vui lòng nhập lại mật khẩu

source: Passwords do not match
vi: Mật khẩu không khớp

source: Creating account...
vi: Đang tạo tài khoản...

source: Create new account
vi: Tạo tài khoản mới

source: Enter information to start
vi: Điền thông tin để bắt đầu

source: Please enter full name
vi: Vui lòng nhập họ và tên

source: Please enter email
vi: Vui lòng nhập email

source: Invalid email
vi: Email không hợp lệ

source: Remember me
vi: Nhớ tài khoản

source: Logging in...
vi: Đang đăng nhập...

source: Resend code
vi: Gửi lại mã

source: Back to login
vi: Quay lại đăng nhập

source: Email invalid
vi: Email không hợp lệ

# please_enter_phone
source: Please enter phone number
vi: Vui lòng nhập số điện thoại

source: Please enter code
vi: Vui lòng nhập mã

source: Please enter confirm code
vi: Vui lòng nhập mã xác nhận

source: Camera
vi: Máy ảnh

source: Gallery
vi: Thư viện ảnh

source: Update
vi: Cập nhật

source: Update profile
vi: Cập nhật hồ sơ

# update_profile_success
source: Update profile successfully
vi: Cập nhật hồ sơ thành công

source: Update profile failed
vi: Cập nhật hồ sơ thất bại

# update_profile_description
source: Update your information
vi: Cập nhật thông tin của bạn

# update_profile_description_success
source: Update your information successfully
vi: Cập nhật thông tin thành công

# update_profile_description_failed
source: Update your information failed
vi: Cập nhật thông tin thất bại

source: Please enter Instagram link
vi: Vui lòng nhập liên kết Instagram

source: Please enter Twitter link
vi: Vui lòng nhập liên kết Twitter

source: Please enter LinkedIn link
vi: Vui lòng nhập liên kết LinkedIn

source: Please enter GitHub link
vi: Vui lòng nhập liên kết GitHub

source: Please enter GitLab link
vi: Vui lòng nhập liên kết GitLab

source: Please enter Bitbucket link
vi: Vui lòng nhập liên kết Bitbucket

source: Please enter Facebook link
vi: Vui lòng nhập liên kết Facebook

source: Please enter valid birth date
vi: Vui lòng nhập ngày sinh hợp lệ

source: Please enter valid phone number
vi: Vui lòng nhập số điện thoại hợp lệ

source: Please enter valid address
vi: Vui lòng nhập địa chỉ hợp lệ

source: Please enter valid Facebook link
vi: Liên kết Facebook không hợp lệ

source: Please enter valid Instagram link
vi: Vui lòng nhập liên kết Instagram hợp lệ

source: Please enter valid Twitter link
vi: Vui lòng nhập liên kết Twitter hợp lệ

source: Please enter valid LinkedIn link
vi: Liên kết LinkedIn không hợp lệ

source: Please enter valid GitHub link
vi: Vui lòng nhập liên kết GitHub hợp lệ

source: Please enter valid GitLab link
vi: Vui lòng nhập liên kết GitLab hợp lệ

source: Please enter valid Bitbucket link
vi: Vui lòng nhập liên kết Bitbucket hợp lệ

# cannot_select_image_message
source: Cannot select image
vi: Không thể chọn ảnh

source: Cannot access camera
vi: Không thể truy cập camera

source: Please grant permission to access camera or gallery in settings
vi: Vui lòng cấp quyền truy cập camera/thư viện ảnh trong cài đặt

source: No available camera
vi: Không có camera khả dụng

source: No content to display
vi: Không có nội dung để hiển thị

source: Privacy and security
vi: Quyền riêng tư và bảo mật

# required_field
source: Required
vi: Bắt buộc

source: Select file
vi: Chọn file

source: From file picker
vi: Từ file picker

source: In memory
vi: Trong bộ nhớ

source: Ready to upload
vi: Sẵn sàng upload

source: Uploading...
vi: Đang upload...

source: Upload success
vi: Upload thành công

source: Cover image
vi: Ảnh Bìa

source: Optional
vi: Tùy chọn

source: Select cover image
vi: Chọn ảnh bìa

source: Recommended size
vi: Khuyến nghị: 600x900px

source: Upload cover image
vi: Upload ảnh

source: Cover image uploaded successfully
vi: Ảnh bìa đã upload thành công

source: Book information
vi: Thông tin sách

source: Title
vi: Tiêu đề

source: Author
vi: Tác giả

source: Description
vi: Mô tả

source: Publisher
vi: Nhà xuất bản

source: Total pages
vi: Số trang

source: Category
vi: Thể loại

source: Public
vi: Công khai

source: Private
vi: Riêng tư

source: Book will be displayed for everyone
vi: Sách sẽ hiển thị cho mọi người

source: Book will be displayed for admin
vi: Sách chỉ hiển thị cho admin

source: Creating book...
vi: Đang tạo sách...

source: Create new book
vi: Tạo Sách Mới

source: Please enter author
vi: Vui lòng nhập tác giả

source: Please enter description
vi: Vui lòng nhập mô tả

source: Please enter publisher
vi: Vui lòng nhập nhà xuất bản

source: Please enter ISBN
vi: Vui lòng nhập ISBN

source: Please enter total pages
vi: Vui lòng nhập số trang

source: Please enter category
vi: Vui lòng nhập thể loại

source: Please enter title
vi: Vui lòng nhập tiêu đề

# select_language
source: Please enter language
vi: Vui lòng nhập ngôn ngữ

# translate
source: Language translation
vi: Ngôn ngữ dịch

source: Convert text to speech
vi: Chuyển đổi text to speech

# library
source: Ebook library
vi: Thư viện Ebook

source: TTS Language Settings
vi: Cài đặt ngôn ngữ TTS

# selectTTSLanguage
source: Select reading language
vi: Chọn ngôn ngữ đọc

source: TTS Settings
vi: Cài đặt TTS

# ttsSpeed
source: Reading speed
vi: Tốc độ đọc

# ttsVolume
source: Volume
vi: Âm lượng

# ttsPitch
source: Voice pitch
vi: Cao độ giọng nói

# ttsVoice
source: Voice
vi: Giọng đọc

# testTTS
source: Test reading
vi: Kiểm tra đọc

# ttsTestText
source: Hello, this is a text-to-speech test.
vi: Xin chào, đây là bài kiểm tra đọc văn bản.

source: No languages available
vi: Không có ngôn ngữ khả dụng

source: Current language
vi: Ngôn ngữ hiện tại

source: Available languages
vi: Ngôn ngữ khả dụng

source: Select voice
vi: Chọn giọng đọc

source: Default voice
vi: Giọng mặc định

source: Reading speed
vi: Tốc độ đọc

source: Slow
vi: Chậm

source: Normal
vi: Bình thường

source: Fast
vi: Nhanh

source: Very fast
vi: Rất nhanh

source: Voice pitch
vi: Cao độ giọng

source: Low
vi: Thấp

source: Medium
vi: Trung bình

source: High
vi: Cao

source: Play test
vi: Phát thử

# stopTest
source: Stop
vi: Dừng

source: Language changed
vi: Đã thay đổi ngôn ngữ

source: Settings saved
vi: Đã lưu cài đặt

source: Error changing language
vi: Lỗi khi thay đổi ngôn ngữ

source: Error saving settings
vi: Lỗi khi lưu cài đặt

source: TTS not initialized
vi: TTS chưa được khởi tạo

source: Initializing TTS...
vi: Đang khởi tạo TTS...

source: Notification Settings
vi: Cài đặt thông báo

source: Notification Preferences
vi: Tùy chọn thông báo

source: Enable notifications
vi: Bật thông báo

source: Disable notifications
vi: Tắt thông báo

source: Push Notifications
vi: Thông báo đẩy

# receivePushNotifications
source: Receive push notifications from server
vi: Nhận thông báo đẩy từ server

source: Local Notifications
vi: Thông báo cục bộ

# receiveLocalNotifications
source: Receive reminders and local notifications
vi: Nhận nhắc nhở và thông báo cục bộ

source: Reading Reminders
vi: Nhắc nhở đọc sách

# setReadingReminders
source: Set daily reading reminders
vi: Đặt nhắc nhở đọc sách hàng ngày

source: Reminder Time
vi: Thời gian nhắc nhở

source: Select reminder time
vi: Chọn thời gian nhắc nhở

source: Book Updates
vi: Cập nhật sách

# receiveBookUpdates
source: Receive notifications for new books
vi: Nhận thông báo khi có sách mới

source: System Notifications
vi: Thông báo hệ thống

# receiveSystemNotifications
source: Receive app update notifications
vi: Nhận thông báo về cập nhật ứng dụng

source: Notification Sound
vi: Âm thanh thông báo

source: Enable sound
vi: Bật âm thanh

# notificationVibration
source: Vibration
vi: Rung

source: Enable vibration
vi: Bật rung

# showBadge
source: Show badge on app icon
vi: Hiển thị badge trên icon

source: Notification Preview
vi: Xem trước thông báo

# showPreview
source: Show content on lock screen
vi: Hiển thị nội dung trên màn hình khóa

source: Test Notification
vi: Kiểm tra thông báo

source: Send test notification
vi: Gửi thông báo thử nghiệm

source: Test notification sent
vi: Đã gửi thông báo thử nghiệm

source: Notification permission required
vi: Cần cấp quyền thông báo

source: Open Settings
vi: Mở cài đặt

source: Permission denied
vi: Quyền bị từ chối

source: Permission granted
vi: Quyền đã được cấp

source: Notification Categories
vi: Danh mục thông báo

source: Manage notification categories
vi: Quản lý danh mục thông báo

source: Clear all notifications
vi: Xóa tất cả thông báo

# notificationsCleared
source: All notifications cleared
vi: Đã xóa tất cả thông báo

source: No notifications
vi: Không có thông báo

source: Notification History
vi: Lịch sử thông báo

source: View notification history
vi: Xem lịch sử thông báo

source: Copy token
vi: Sao chép token

source: Token copied
vi: Đã sao chép token

source: Refresh token
vi: Làm mới token

source: Token refreshed
vi: Token đã được làm mới

source: Notification Status
vi: Trạng thái thông báo

source: Permission Status
vi: Trạng thái quyền

# new_book
source: New
vi: Mới

source: Read book
vi: Đọc sách

source: View details
vi: Xem chi tiết

source: Add favorite
vi: Thêm yêu thích

source: Remove favorite
vi: Bỏ yêu thích

source: Add archive
vi: Thêm lưu vào thư viện

source: Remove archive
vi: Bỏ lưu vào thư viện

source: File ebook not found
vi: File ebook không tồn tại

source: Filter
vi: Lọc

source: All
vi: Tất cả

source: Unread
vi: Chưa đọc

source: Read
vi: Đã đọc

source: Delete all
vi: Xóa tất cả

source: Are you sure you want to delete all notifications?
vi: Bạn có chắc chắn muốn xóa tất cả thông báo?

source: Mark all as read
vi: Đánh dấu tất cả đã đọc

source: Mark all as unread
vi: Đánh dấu tất cả chưa đọc

# markAllAsReadSuccess
source: Mark all as read successfully
vi: Đánh dấu tất cả đã đọc thành công

# markAllAsUnreadSuccess
source: Mark all as unread successfully
vi: Đánh dấu tất cả chưa đọc thành công

source: Mark all as read failed
vi: Đánh dấu tất cả đã đọc thất bại

source: Mark all as unread failed
vi: Đánh dấu tất cả chưa đọc thất bại

# deleteAllNotificationsSuccess
source: Delete all notifications successfully
vi: Xóa tất cả thông báo thành công

source: Delete all notifications failed
vi: Xóa tất cả thông báo thất bại

# markReadSuccess
source: Mark read successfully
vi: Đánh dấu đã đọc thành công

source: Mark read failed
vi: Đánh dấu đã đọc thất bại

# markUnreadSuccess
source: Mark unread successfully
vi: Đánh dấu chưa đọc thành công

source: Mark unread failed
vi: Đánh dấu chưa đọc thất bại

# deleteNotificationSuccess
source: Delete notification successfully
vi: Xóa thông báo thành công

source: Delete notification failed
vi: Xóa thông báo thất bại

# markAsReadSuccess
source: Mark as read successfully
vi: Đánh dấu đã đọc thành công

source: Mark as read failed
vi: Đánh dấu đã đọc thất bại

# markAsUnreadSuccess
source: Mark as unread successfully
vi: Đánh dấu chưa đọc thành công

source: Mark as unread failed
vi: Đánh dấu chưa đọc thất bại

source: Delete notification
vi: Xóa thông báo

source: Mark as read
vi: Đánh dấu đã đọc

source: Mark as unread
vi: Đánh dấu chưa đọc

source: You have
vi: Bạn có

source: unread notifications
vi: thông báo chưa đọc

source: Delete
vi: Xóa

source: Notification deleted successfully
vi: Đã xóa thông báo thành công

source: Notification deleted failed
vi: Đã xóa thông báo thất bại

# areYouSureYouWantToDeleteNotification
source: Are you sure you want to delete this notification?
vi: Bạn có chắc chắn muốn xóa thông báo này?

source: Add new book to library
vi: Thêm sách mới vào thư viện

source: Please upload ebook file first
vi: Vui lòng upload file ebook trước

source: Book has been added to local library
vi: Sách đã được thêm vào thư viện local

source: You will receive notifications here
vi: Bạn sẽ nhận được thông báo ở đây
